Xml-integration-demo/HotelRQ/20210620171509102AvailableHotelRooms.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><hot:Credentials Password="Sra@12896022" UserName="WESARA"/><wsa:Action>http://TekTravel/HotelBookingApi/AvailableHotelRooms</wsa:Action><wsa:To>https://api.tboholidays.com/HotelApi_V7/HotelService.svc</wsa:To></env:Header><env:Body><HotelRoomAvailabilityRequest xmlns="http://TekTravel/HotelBookingApi"><SessionId>edff05e5-a36f-4fb2-aed1-9f8f8217dc89</SessionId><ResultIndex>8</ResultIndex><HotelCode>1361143</HotelCode><ResponseTime>17</ResponseTime><IsCancellationPolicyRequired>false</IsCancellationPolicyRequired></HotelRoomAvailabilityRequest></env:Body></env:Envelope>